/*- Дано натуральное число n. Выведите все числа от 1 до n. */

let toN = (n) => {
    for (let i = 1; i <= n; i++) {
        console.log(i)
    }
}

//toN(10)

/*~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~*/

/*- Даны два целых числа A и В . Выведите все числа от A до B включительно,
 в порядке возрастания, если A < B, или в порядке убывания в противном случае. */

let fromAtoB = (a, b) => {
    if (a < b) {
        for (let i = a; i <= b; i++) {
            console.log(i)
        }
    } else {
        for (let i = a; i >= b; i--) {
            console.log(i)
        }
    }
}

//fromAtoB(10,20);
//fromAtoB(30,25);

/*~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~*/

/* -   функція Приймає масив та число "i", та міняє місцями об`єкт який знаходиться в індексі "i" на "i+1"
  EXAMPLE:
  foo([9,8,0,4], 0) // ==> [ 8, 9, 0, 4 ]
  foo([9,8,0,4], 1) // ==> [ 9 ,0, 8, 4 ]
  foo([9,8,0,4], 2) // ==> [ 9, 8, 4, 0 ]
   */

let change = (arr, i) => {
    let empty = arr[i];
    arr[i] = arr[i + 1];
    arr[i + 1] = empty;
    return arr;
}

//console.log(change([9, 8, 0, 4], 0));

/*~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~*/

/* - Сворити функцію яка буде переносити елементи з значенням 0 у кінець маисву. Зберігаючи при цьому порядок не нульових значень.
Двожина масиву від 2 до 100
EXAMPLE:
[1,0,6,0,3] => [1,6,3,0,0]
[0,1,2,3,4] => [1,2,3,4,0]
[0,0,1,0]   => [1,0,0,0]
 */

let zeroToBack = (a) => {
    let b = [];
    let flag = 0;
    let j = 0;
    for (let aElement of a) {
        if (aElement === 0) {
            flag++;
        } else {
            b[j] = aElement;
            j++
        }
    }
    for (let i = 1; i <= flag; i++, j++) {
        b[j] = 0;
    }
    return b;
}

//console.log(zeroToBack([0,1,2,3,4]));



