/*  - Нам дано масив друзів let friends = ["Ivan", "Slavik", "Grisha", "Lera", "Ira"];
 Потрібно зробити перевірку якщо
 кількість елементів у масиві більше або дорівнює 3, то виводиться повідомлення про те,
  що це великий масив, в якому  3 і більше елементи.
 Інакше слід вивести на екран повідомлення про те, що це маленький масив, в якому менше 3-х елементів.
*/

/*
let friends = ["Ivan", "Slavik", "Grisha", "Lera", "Ira"];
let a = friends.length;
a >= 3 ? document.write(`<h4>Це великий масив, у ньому 3 і більше елементів</h4>`) : document.write(`<h4>Це малий масив</h4>`);
*/

/*----------------------------------------------------------------------------------------------------------*/

/*  - Маємо 3 числа і між ним  нам потрібно знайти те що посередині.
 Знайти, яке з них є середнім (більше одного, але менше за інше).
  Перевірити, чи знаходиться перше число між двома іншими.*/

/*
let a = +prompt('Введіть перше число');
let b = +prompt('Введіть друге число');
let c = +prompt('Введіть третє число');

if(a === b || b === c || a === c){
    document.write(`<h4 class="red">Ви ввели однакові числа</h4>`)
} else {
    if((a > b && b > c) || (c > b && b > a)){
        document.write(`<h4>Середнє - друге число (${b})</h4>`)
    } else if ((a > c && c > b) || (b > c && c > a)){
        document.write(`<h4>Середнє - третє число (${c})</h4>`)
    } else{
        document.write(`<h4>Середнє - перше число (${a})</h4>`)
    }
}
 */

/*----------------------------------------------------------------------------------------------------------*/


/*  - Перепишіть конструкцію if з використанням умовного оператора '?':
 let result;
 if (a + b < 4) {
    result = 'Мало';
 } else {
    result = 'Багато';
 }*/

/*let a = +prompt('Введіть перше число');
let b = +prompt('Введіть друге число');

a + b < 4 ? document.write(`<h4>Мало</h4>`) : document.write(`<h4>Багато</h4>`);*/

/*----------------------------------------------------------------------------------------------------------*/


/*- Маємо будь яке число від -100 , 0 , +100 потрібно перевірити яким є число:
 позитивним, негативним або нулем
напишіть це тернарним оператором*/


/*
let num = +prompt('Введіть число')
num < 0 ? document.write(`<h4>Число від'ємне</h4>`) : num === 0 ? document.write(`<h4>Число нуль</h4>`) : document.write(`<h4>Число додатнє</h4>`)
*/