/*- Користувач вводить або має два числа.
Потрібно знайти та вивести максимальне число з тих двох .
Також потрібно врахувати коли введені рівні числа.*/

/*
let a = +prompt('Введіть перше число');
let b = +prompt('Введіть друге число');
a > b ? document.write(`<h4>Перше число (${a}) - більше</h4>`) : a < b ? document.write(`<h4>Друге число (${b}) - більше</h4>`) : document.write(`<h4>Два числа рівні</h4>`);*/

/*----------------------------------------------------------------------------------------------------------*/

/* - У першому під'їзді квартири з 1 до 20. У другому з 21 по 48. У третьому з 49 по 90.
Користувач вводить номер квартири просто в змінні або через prompt('') .
Програма повинна зазначити, в якому під'їзді знаходиться дана квартира.*/

/*
let num = +prompt('Введіть номер квартири');
if (num >= 1 && num <= 90){
    if (num >= 1 && num <= 20){
        document.write(`<h4>Квартира знаходиться у першому під'їзді</h4>`);
    } else if(num >= 21 && num <= 48){
        document.write(`<h4>Квартира знаходиться у другому під'їзді</h4>`);
    } else {
        document.write(`<h4>Квартира знаходиться у третьому під'їзді</h4>`);
    }
} else {
    document.write(`<h4 class="red">Неправильний номер квартири</h4>`);
}*/

/*----------------------------------------------------------------------------------------------------------*/


/* - Ми маємо змінну number в яку користувач задає числове значення,
 якщо змінна рівна 10 вивести повідомлення ВІРНО, якщо змінна не рівна 10 - тоді НЕВІРНО */

/*
let number = +prompt('Введіть число');
number === 10 ? document.write(`<h4>Вірно</h4>`) : document.write(`<h4 class="red">Невірно</h4>`);
*/

/*----------------------------------------------------------------------------------------------------------*/


/* - Ми маємо змінну x в яку користувач задає  значення,  якщо в змінну записане число, вивести 1,
якщо в змінну записали стрінгу вивести 2, якщо булеве значення - 3, якщо об'єкт або масив - 3.
якщо в змінну записали щось інше, спрацьовує else
 */

/*
let x;
// x = 5;
// x = 'Hello'
// x = true;
// x = [3, 4, 5]
// x = undefined;

if(typeof x === 'number'){
    document.write(`<h4>1</h4>`)
} else if (typeof  x === 'string'){
    document.write(`<h4>2</h4>`)
} else if (typeof  x === 'boolean'){
    document.write(`<h4>3</h4>`)
} else if (typeof  x === 'object'){
    document.write(`<h4>4</h4>`)
} else {
    document.write(`<h4 class="red">undefined</h4>`);
}
*/

/*----------------------------------------------------------------------------------------------------------*/

/*- Задача-гра "чи ми йдемо сьогодні в OKTEN на навчання?".
Змінна, яка характеризує температуру. Якщо температура від +10 до +22 вивести повідомлення що ми йдемо ВЧИТИСЯ .
Якщо інша темпаретура, тоді виводимо повідомлення що сидимо вдома і вчимося ОНЛАЙН*/

/*
let temp = +prompt('Яка сьогодні температура?')
temp >= 10 && temp <=22 ? document.write(`<h4>Йдемо вчитися</h4>`) : document.write(`<h4 class="red">Вчимося онлайн</h4>`);
 */

/*----------------------------------------------------------------------------------------------------------*/

/*  - За допомогою switch case - реалізувати гру - вікторину,
 де ми вводимо число від 1 до 5. І взалежності від введеного
числа нам дається приз. (Авто, Мото, Телефон, і т.д ) і
якщо число не підходить тоді  вивести Повідомлення - що число не вірне ... . */

/*
let num = +prompt('Введіть число від 1 до 5');
switch (num){
    case 1:
        document.write(`<h4>Автомобіль</h4>`)
        break
    case 2:
        document.write(`<h4>Телефон</h4>`)
        break
    case 3:
        document.write(`<h4>Ноутбук</h4>`)
        break
    case 4:
        document.write(`<h4>Навушники</h4>`)
        break
    case 5:
        document.write(`<h4>Грамота))</h4>`)
        break
    default:
        document.write(`<h4 class="red">Ну просив ж, число від 1 до 5, а ти що ввів?</h4>`)
}
*/


