/*  - Дано змінну time яка рівна числу від 0 до 59. Потрібно написати код,
 який перевірить, до якої четверті години попадає число
(в першу, другу, третю или четверту частину години). */

/*
let time = prompt('введіть число від 0 до 59');
if(time >= 0 && time <=59){
    if(time >= 0 && time <= 15){
        document.write(`<h4>Число належить до першої чверті</h4>`)
    } else if(time > 15 && time <= 30){
        document.write(`<h4>Число належить до другої чверті</h4>`)
    } else if(time > 30 && time <= 45){
        document.write(`<h4>Число належить до третьої чверті</h4>`)
    } else if(time > 45 && time <= 59){
        document.write(`<h4>Число належить до четвертої чверті</h4>`)
    }
} else{
    document.write(`<h4 class="red">Помилка, введіть коректні дані!</h4>`)
}
*/

/*----------------------------------------------------------------------------------------------------------*/

/*- У змінній day дано якесь число від 1 до 31.
 Потрібно визначити, у яку половину(декаду) місяця
 потрапляє це число (у першу, другу чи третю).*/

/*
let date = prompt('Введіть день місяця:');
if(date >= 1 && date <= 31){
  if(date >= 1 && date <= 10){
      document.write(`<h4>Дата належить до першої декади</h4>`)
  } else if(date >= 11 && date <= 21){
      document.write(`<h4>Дата належить до другої декади</h4>`)
  } else{
      document.write(`<h4>Дата належить до третьої декади</h4>`)
  }
} else{
    document.write(`<h4 class="red">Дурачок?) Не може бути стільки днів в місяці))</h4>`)
} */

/*----------------------------------------------------------------------------------------------------------*/

/*- У нас є змінна test, якщо  не дорівнює true, виведіть 'Вірно', інакше виведіть 'Неправильно'.
Перевірте роботу скрипта при test, що дорівнює true, false.
Напишіть два варіанти скрипта - з коротким записом(тернаркою)*/


/*let test = prompt('Введіть значення: true або false')
if (test === 'true' || test === 'false'){
    test === 'true' ? test = true : test = false;

    //далі 2 варіанти скрипта - розкоментуйте їх по черзі для перевірки


    if(test === true){
        document.write(`<h4>Вірно))</h4>`)
    } else{
        document.write(`<h4>Неправильно((</h4>`)
    }

  /!*  test === true ? document.write(`<h4>Вірно))</h4>`) : document.write(`<h4>Неправильно((</h4>`); *!/


} else {
    document.write(`<h4 class="red">Ну та просив ж true або false... А ти що написав?..</h4>`)
}*/

/*----------------------------------------------------------------------------------------------------------*/

/* - Якщо змінна a не дорівнює нулю, виведіть 'Вірно', інакше виведіть 'Невірно'.
Перевірте  скрипт при a, що дорівнює 1, 0, -3 */

/*
let a = +prompt('Введіть довільне ціле число');
a !== 0 ? document.write(`<h4>Вірно</h4>`) : document.write(`<h4 class="red">Невірно</h4>`);
*/

/*----------------------------------------------------------------------------------------------------------*/

/* - Скласти розклад на тиждень за домопоги switch.
Користувач вводить порядковий номер дня тижня і на екрані відображається інфа
що заплановано на цей день.*/

/*
let day = +prompt('Введіть номер дня тижня');
if (day >= 1 && day <= 7){
    switch (day){
        case 1:
            document.write(`
                <h4 class="red day">Понеділок</h4></br>
                <h4 class="day">1) Потратити пів дня на лекціЇ в універі</h4></br>
                <h4 class="day">2) Зайнятися простолюдинськими справами</h4></br>
                <h4 class="day">3) Послухати нормальну лекцію</h4></br>
                <h4 class="day">4) Засісти за код</h4></br>
                <h4 class="day">5) Добраніч</h4></br>
            `)
            break
        case 2:
            document.write(`
                <h4 class="red day">Вівторок</h4></br>
                <h4 class="day">1) Потратити пів дня на лекції в універі</h4></br>
                <h4 class="day">2) Зайнятися простолюдинськими справами</h4></br>
                <h4 class="day">3) Кодити</h4></br>
                <h4 class="day">4) Добраніч</h4></br>
            `)
            break
        case 3:
            document.write(`
                <h4 class="red day">Середа</h4></br>
                <h4 class="day">1) Забити на універ</h4></br>
                <h4 class="day">2) Зайнятися простолюдинськими справами</h4></br>
                <h4 class="day">3) Погудувати кота, бо він 2 дні не їв нічого</h4></br>
                <h4 class="day">4) Послухати лекцію в октен</h4></br>
                <h4 class="day">5) Кодити</h4></br>
                <h4 class="day">6) Добраніч</h4></br>
            `)
            break
        case 4:
            document.write(`
                <h4 class="red day">Четвер</h4></br>
                <h4 class="day">1) Слухати пари з універу, бо вчора забив</h4></br>
                <h4 class="day">2) Зайнятися простолюдинськими справами</h4></br>
                <h4 class="day">3) Погудувати кота, виявляється вони мають щодня декілька разів їсти</h4></br>
                <h4 class="day">4) Кодити</h4></br>
                <h4 class="day">5) Добраніч</h4></br>
            `)
            break
        case 5:
            document.write(`
                <h4 class="red day">П'ятниця</h4></br>
                <h4 class="day">1) Та який універ, сьогодні п'ятниця</h4></br>
                <h4 class="day">2) Зайнятися простолюдинськими справами</h4></br>
                <h4 class="day">3) Знову кіт</h4></br>
                <h4 class="day">4) Лекція Сергія</h4></br>
                <h4 class="day">5) Код</h4></br>
                <h4 class="day">6) Добраніч</h4></br>
            `)
            break
        case 6:
            document.write(`
                <h4 class="red day">Субота</h4></br>
                <h4 class="day">1) Інгліш</h4></br>
                <h4 class="day">2) Код</h4></br>
                <h4 class="day">3) Знову кіт</h4></br>
                <h4 class="day">4) Чіл</h4></br>
                <h4 class="day">5) Код</h4></br>
                <h4 class="day">6) Добраніч</h4></br>
            `)
            break
        case 7:
            document.write(`
                <h4 class="red day">Неділя</h4></br>
                <h4 class="day">1) Пам'ятай святий день святкувати!</h4></br>
            `)
            break
    }
} else {
    document.write(`<h4 class="red">Ви ввели некоректні дані</h4>`);
}
*/


/*----------------------------------------------------------------------------------------------------------*/
/*- Потрібно визначити Високосний рік чи ні.
 Високосні роки діляться націло на 4.*/

/*
let year = +prompt('Який рік ви хочете перевірити на високосність?');
year % 4 === 0 ? document.write(`<h4>Рік високосний</h4>`) : document.write(`<h4>Рік не високосний</h4>`);
*/

/*----------------------------------------------------------------------------------------------------------*/

/*- Використовуючи конструкцію if..else, напишіть код, який запитуватиме: „Яка «офіційна» назва JavaScript?“
Якщо користувач вводить «ECMAScript», то показати: «Правильно!», інакше – відобразити: «Не знаєте? ECMAScript!*/

/*
let js = prompt('Яка офіційна назва JavaScript? (регістр важливий)')
if (js === 'ECMAScript'){
    document.write(`<h4>Та ти геній</h4>`)
} else {
    document.write(`<h4>Не знаєте? ECMAScript!</h4>`)
}
*/



