/******(Прям овердоз с рекурсией) Создать функцию которая принимает какой-либо элемент DOM-структуры .
 * Функция создает в боди 2 кнопки (назад/вперед)
 при нажатии вперед, вы переходите к дочернему элементу, при еще одном нажатии на "вперед",
 вы переходите к следующему дочернему элементу (лежащему на одном уровне)
 НО если у (какого-либо)дочеренего элемента есть дети, то нажатие "вперед" позволяет нам войти
 внутрь элемента и  выводит первого ребенка. и тд.
 Когда все дети заканчиваются, мы выходим из данного дочернего элемента и переходим к следующему,
 лежащему с ним на одном уровне*/

let down = document.getElementById('down')
let up = document.getElementById('up')

function goTo (object){
    let target = object.children;
    for (let i = 0; i < target.length; i++) {
        goTo(target[i]);
        console.log(target[i])
    }
}

goTo(document.body);


// Друже ментор, підкажи в якому напрямку рухатися
// Як зробити так, щоб я керував змінною і, яка ітерує об'єкти, з кнопок подружити це з рекурсією
// Якщо окремо ці 2 дії я можу зробити, то разом не виходить
// то у функції кнопки рекурсія просто оне працює, а якщо винести рекурсію за кнопку то компілятор сповіщає безкінечну рекурсію
// підкажи чи я у правильному напрямку рухаюсь чи взагалі треба щось інше