/* --створити масив з:
- з 5 числових значень
- з 5 стічкових значень
- з 5 значень стрічкового, числового та булевого типу
- та вивести його в консоль*/


/*
let num = [1, 4, 66, 77, 88];
let str = ['vasya', 'petro', 'ivan', 'olya', 'max'];
let mix = ['hello', 1234, true, 'bye', false];

console.log(num);
console.log(str);
console.log(mix);
*/

/*----------------------------------------------------------------------------------------*/

/*-- Створити пустий масив.
Наповнити його будь-якими значеннями звертаючись до конкретного індексу.
Вивести в консоль*/

/*let arr = [];
/!*arr [0] = 1;
arr [1] = 12;
arr [2] = 'hello';
arr [3] = true;*!/

for(let i = 0; i <= 5; i++){
    arr [i] = `item ${i}`;
}
console.log(arr);*/

/*----------------------------------------------------------------------------------------*/

/*- За допомогою циклу for і document.write() вивести 10 блоків div c довільним текстом всередині*/

/*
for(let i = 1; i <= 10; i++){
    document.write(`<div>Text must be here</div>`)
}
*/

/*----------------------------------------------------------------------------------------*/

/*- За допомогою циклу for і document.write() вивести 10 блоків div c довільним текстом і індексом всередині
*/

/*
for(let i = 1; i <= 10; i++){
    document.write(`<div>Об'єкт ${i}</div>`);
}
*/

/*----------------------------------------------------------------------------------------*/

/*- За допомогою циклу while вивести в документ 20 блоків h1 c довільним текстом всередині.
*/

/*let i = 1;
while(i <= 20){
    document.write(`<h1>Hello world</h1>`);
    i++;
}*/

/*----------------------------------------------------------------------------------------*/

/*- За допомогою циклу while вивести в документ 20 блоків h1 c довільним текстом і індексом всередині.*/

/*let x = 1;
while(x <= 20){
    document.write(`<h1>sth${x}</h1>`);
    x++;
}*/

/*----------------------------------------------------------------------------------------*/

/*- Створити масив з 10 числових елементів. Вивести в консоль всі його елементи в циклі.*/

/*
let arr = [];
for(let i = 0; i < 10; i++){
    arr[i] = i**2+5 //просто рандомна умова для генерації числа, бо лінь прописувати вручну
    console.log(arr[i]);
}*/

/*----------------------------------------------------------------------------------------*/

/*- Створити масив з 10 строкрових елементів. Вивести в консоль всі його елементи в циклі.*/

/*
let arr = [];
for(let i = 0; i < 10; i++){
    arr[i] = `Рядок ${i + 1}`;
    console.log(arr[i]);
}
*/

/*----------------------------------------------------------------------------------------*/

/*- Створити масив з 10 елементів будь-якого типу. Вивести в консоль всі його елементи в циклі.*/

/*let arr = [];
for(let i = 0; i < 10; i ++){
    if(i % 2 === 0){
        arr[i] = `String ${i/2+1}`
    } else{
        arr[i] = i**3-7 //просто рандомна умова для генерації числа, бо лінь прописувати вручну
    }
    console.log(arr[i]);
}*/

/*----------------------------------------------------------------------------------------*/

/*- Створити масив з 10 елементів числового, стірчкового і булевого типу.
 За допомогою if та typeof вивести тільки булеві елементи
*/

/*
let arr = [1, 'hello', true, false, 34, 'world', 112, 'vasya', true, 1222];
for(let i = 0; i < arr.length; i++){
    if(typeof arr[i] === "boolean"){
        console.log(arr[i]);
    }
}
*/

/*----------------------------------------------------------------------------------------*/

/*- Створити масив з 10 елементів числового,
 стірчкового і булевого типу. За допомогою if та typeof
 вивести тільки числові елементи*/

/*let arr = [1, 'hello', true, false, 34, 'world', 112, 'vasya', true, 1222];
for(let i = 0; i < arr.length; i++){
    if(typeof arr[i] === "number"){
        console.log(arr[i]);
    }
}*/

/*----------------------------------------------------------------------------------------*/

/*- Створити масив з 10 елементів числового, стрічкового і булевого типу.
За допомогою if та typeof вивести тільки рядкові елементи*/

/*let arr = [1, 'hello', true, false, 34, 'world', 112, 'vasya', true, 1222];
for(let i = 0; i < arr.length; i++){
    if(typeof arr[i] === "string"){
        console.log(arr[i]);
    }
}*/

/*----------------------------------------------------------------------------------------*/

/*- Створити порожній масив. Наповнити його 10 елементами (різними за типами)
через звернення до конкретних індексів. Вивести в консоль всі його елементи в циклі.*/

/*
let arr = [];
arr[0] = 33;
arr[1] = 'hi';
arr[2] = true;
arr[3] = 45664;
arr[4] = false;
arr[5] = 'petya';
arr[6] = 666;
arr[7] = true;
arr[8] = 689;
arr[9] = 10006;
for(let i = 0; i < arr.length; i++){
    console.log(arr[i]);
}
*/

/*----------------------------------------------------------------------------------------*/

/*- Створити цикл for на 10  ітерацій з кроком 1.
 Вивести поточний номер кроку через console.log та document.write
*/

/*
for(let i = 0; i < 10; i++){
    document.write(`<h1>Крок ${i+1}</h1>`);
    console.log(`Крок ${i+1}`);
}
*/

/*----------------------------------------------------------------------------------------*/

/*  - Створити цикл for на 100 ітерацій з кроком 1.
 Вивести поточний номер кроку через console.log та document.write
*/

/*for(let i = 0; i < 100; i++){
    document.write(`<h1>Крок №${i+1}</h1>`);
    console.log(`Крок №${i+1}`);
}*/

/*----------------------------------------------------------------------------------------*/

/*- Створити цикл for на 100 ітерацій з кроком 2.
 Вивести поточний номер кроку через console.log та document.write
*/

/*for(let i = 0; i < 100; i+=2){
    document.write(`<h1>Крок №${i+1}</h1>`);
    console.log(`Крок №${i+1}`);
}*/

/*----------------------------------------------------------------------------------------*/

/*- Створити цикл for на 100 ітерацій.
Вивести тільки парні кроки. через console.log + document.write
*/

/*for(let i = 1; i <= 100; i++){
    if(i % 2 === 0){
        document.write(`<h1>Крок №${i}</h1>`);
        console.log(`Крок №${i}`);
    }
}*/

/*----------------------------------------------------------------------------------------*/

/*- Створити цикл for на 100 ітерацій.
Вивести тільки непарні кроки. через console.log + document.write*/

/*
for(let i = 1; i <= 100; i++){
    if(i % 2 === 1){
        document.write(`<h1>Крок №${i}</h1>`);
        console.log(`Крок №${i}`);
    }
}*/
